#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НТ_КонтактныеЛица.Наименование КАК Наименование,
		|	НТ_КонтактныеЛица.ДействуетНаОсновании КАК ДействуетНаОсновании
		|ИЗ
		|	Справочник.НТ_КонтактныеЛица КАК НТ_КонтактныеЛица
		|ГДЕ
		|	НТ_КонтактныеЛица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДействуетНаОсновании) Тогда
		 Представление = ВыборкаДетальныеЗаписи.Наименование + " дейстует на основании " + ВыборкаДетальныеЗаписи.ДействуетНаОсновании;
	Иначе
		 Представление = ВыборкаДетальныеЗаписи.Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти